In [1]:
import pandas as pd
import numpy as np
import env

**Use your function to obtain a connection to the employees database.**

In [2]:
pd.read_sql('select * from employees limit 5', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

**Once you have successfully run a query:**
* Intentionally make a typo in the database url. What kind of error message do you see?

In [3]:
pd.read_sql('select * from employees limit 5', env.get_db_urll(env.username, env.hostname, env.password, 'employees'))
#has no attribute

AttributeError: module 'env' has no attribute 'urll'

* Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
pd.read_sql('select * from employees limitt 5', env.get_db_url(env.username, env.hostname, env.password, 'employees'))
#programming error

ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5' at line 1")
[SQL: select * from employees limitt 5]
(Background on this error at: https://sqlalche.me/e/14/f405)

**Read the employees and titles tables into two separate DataFrames.**

In [11]:
employees = pd.read_sql('select * from employees', env.get_db_url(env.username, env.hostname, env.password, 'employees'))
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [10]:
titles = pd.read_sql('select * from titles', env.get_db_url(env.username, env.hostname, env.password, 'employees'))
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

**How many rows and columns do you have in each DataFrame? Is that what you expected?**

In [12]:
print(employees.shape)
print(titles.shape)
#titles was expected to be larger since one employee could have help multiple titles over their career at the company

(300024, 6)
(443308, 4)

**Display the summary statistics for each DataFrame.**

In [20]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [21]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

**How many unique titles are in the titles DataFrame?**

In [25]:
unique_titles = pd.read_sql('''SELECT 
	title
FROM titles
group by title''', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

unique_titles.nunique()

title    7
dtype: int64

**What is the oldest date in the to_date column?**

In [32]:
oldest_date = pd.read_sql('''SELECT 
	*
FROM titles
order by to_date
limit 1''', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

oldest_date.to_date

0    1985-03-01
Name: to_date, dtype: object

**What is the most recent date in the to_date column?**

In [33]:
recent_date = pd.read_sql('''SELECT 
	*
FROM titles
where to_date < '9999-01-01'
order by to_date DESC
limit 1''', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

recent_date.to_date

0    2002-08-01
Name: to_date, dtype: object

**Exercises II**

**Copy the users and roles DataFrames from the examples above.**

In [4]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

**What is the result of using a right join on the DataFrames?**

In [8]:
pd.merge(users, roles, how='right', left_on ='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

**What is the result of using an outer join on the DataFrames?**

In [9]:
pd.merge(users, roles, how='outer', left_on ='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

**What happens if you drop the foreign keys from the DataFrames and try to merge them?**

In [11]:
pd.merge(users, roles, how='outer', left_on ='role_id', right_on='id').drop(columns='role_id')

   id_x name_x  id_y     name_y
0   1.0    bob   1.0      admin
1   2.0    joe   2.0     author
2   3.0  sally   3.0   reviewer
3   4.0   adam   3.0   reviewer
4   5.0   jane   NaN        NaN
5   6.0   mike   NaN        NaN
6   NaN    NaN   4.0  commenter

**Load the mpg dataset from PyDataset.**

In [14]:
from pydataset import data
mpg = data('mpg') # load the dataset and store it in a variable
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

**Output and read the documentation for the mpg dataset.**

In [15]:
print(data('mpg', show_doc=True))
mpg

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.


None

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

**How many rows and columns are in the dataset?**

In [16]:
mpg.shape

(234, 11)

**Check out your column names and perform any cleanup you may want on them.**

In [17]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

**Display the summary statistics for the dataset.**

In [19]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

**How many different manufacturers are there?**

In [20]:
mpg.manufacturer.nunique()

15

**How many different models are there?**

In [21]:
mpg.model.nunique()

38

**Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.**

In [23]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

**Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.**

In [24]:
mpg['average_mileage'] = (mpg.hwy + mpg.cty)//2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21

**Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.**

In [42]:
mpg['is_automatic'] = mpg['trans'].str.contains('auto')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21,True

**Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?**

In [53]:
index_match = mpg.average_mileage.idxmax()
mpg.manufacturer.iloc[index_match]

'volkswagen'

**Do automatic or manual cars have better miles per gallon?**

In [72]:
average_mpg_by_trans = mpg.groupby('is_automatic')['average_mileage'].mean()

print(average_mpg_by_trans)
#manuals have a higher with 22mpg

is_automatic
False    22.038961
True     18.904459
Name: average_mileage, dtype: float64

**Exercises III**

**Use your get_db_url function to help you explore the data from the chipotle database.**

In [23]:
df = pd.read_sql('select * from orders', env.get_db_url(env.username, env.hostname, env.password, 'chipotle'))
df

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

**What is the total price for each order?**

In [15]:
df['item_price'] = df['item_price'].replace('[$]', '', regex=True).astype(float)
df['total_item_price'] = df['quantity'] * df['item_price']
total_price_per_order = df.groupby('order_id')['total_item_price'].sum()
print(total_price_per_order)

order_id
1       11.56
2       33.96
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: total_item_price, Length: 1834, dtype: float64

**What are the most popular 3 items?**

In [44]:
quantity_count = pd.crosstab(df.item_name, df.quantity.count())
sorted_count = quantity_count.sort_values(by = df.quantity.count(), ascending = False)
sorted_count.head()
#chicken bowl, chicken burrito, and chips and guacamole are the three most popular

col_0                4622
item_name
Chicken Bowl          726
Chicken Burrito       553
Chips and Guacamole   479
Steak Burrito         368
Canned Soft Drink     301

**Which item has produced the most revenue?**

In [61]:
df['item_price'] = df['item_price'].replace('[$]', '', regex=True).astype(float)
df['total_item_price'] = df['quantity'] * df['item_price']
most_revenue = df.groupby('item_name')['total_item_price'].sum()
most_revenue.sort_values(ascending=False)
#item with the most revenue is Chicken Bowl

item_name
Chicken Bowl                             8044.63
Chicken Burrito                          6387.06
Steak Burrito                            4236.13
Steak Bowl                               2479.81
Chips and Guacamole                      2475.62
Chicken Salad Bowl                       1506.25
Chicken Soft Tacos                       1199.01
Chips and Fresh Tomato Salsa             1033.96
Veggie Burrito                           1002.27
Veggie Bowl                               901.95
Barbacoa Burrito                          894.75
Carnitas Bowl                             830.71
Barbacoa Bowl                             672.36
Bottled Water                             649.18
Carnitas Burrito                          616.33
Canned Soft Drink                         603.75
Chips                                     580.34
Steak Soft Tacos                          554.55
Chicken Crispy Tacos                      524.11
Steak Salad Bowl                          391.15
Carnitas Soft Tacos                       375.94
Steak Crispy Tacos                        375.32
6 Pack Soft Drink                         369.93
Side of Chips                             290.68
Barbacoa Soft Tacos                       250.46
Canned Soda                               191.84
Veggie Salad Bowl                         182.50
Chips and Tomatillo Red Chili Salsa       159.30
Chips and Tomatillo Green Chili Salsa     144.55
Barbacoa Crispy Tacos                     138.71
Nantucket Nectar                          111.87
Barbacoa Salad Bowl                       106.40
Carnitas Crispy Tacos                      95.94
Chips and Tomatillo-Red Chili Salsa        93.21
Veggie Soft Tacos                          90.94
Chips and Tomatillo-Green Chili Salsa      88.43
Chicken Salad                              81.09
Bowl                                       74.00
Chips and Roasted Chili Corn Salsa         73.75
Izze                                       67.80
Carnitas Salad Bowl                        66.34
Veggie Salad                               50.94
Burrito                                    44.40
Chips and Roasted Chili-Corn Salsa         43.02
Steak Salad                                35.66
Crispy Tacos                               14.80
Salad                                      14.80
Carnitas Salad                              8.99
Veggie Crispy Tacos                         8.49
Chips and Mild Fresh Tomato Salsa           3.00
Name: total_item_price, dtype: float64

######

**Join the employees and titles DataFrames together.**

In [25]:
employee_table = pd.read_sql('select * from employees', env.get_db_url(env.username, env.hostname, env.password, 'employees'))
titles_table = pd.read_sql('select * from titles', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

In [9]:
merged_tables = pd.merge(employee_table, titles_table, how='outer', left_on ='emp_no', right_on='emp_no')
merged_tables

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

**For each title, find the hire date of the employee that was hired most recently with that title.**

In [38]:
pd.read_sql('''SELECT 
    t.title,
    '9999-01-01' as to_date,
    MAX(employees.hire_date) as latest_hire_date
FROM employees
JOIN titles as t
    ON employees.emp_no = t.emp_no
WHERE t.to_date = '9999-01-01'
GROUP BY t.title, t.to_date
ORDER BY latest_hire_date DESC''', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

                title     to_date latest_hire_date
0            Engineer  9999-01-01       2000-01-23
1        Senior Staff  9999-01-01       2000-01-13
2               Staff  9999-01-01       2000-01-12
3     Senior Engineer  9999-01-01       2000-01-01
4  Assistant Engineer  9999-01-01       1999-12-24
5    Technique Leader  9999-01-01       1999-12-15
6             Manager  9999-01-01       1992-02-05

**Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)**

In [34]:
dept_and_titles_table = pd.read_sql('''SELECT
	d.dept_name, t.title
FROM departments as d
JOIN dept_emp as de
	using(dept_no)
JOIN titles as t
	using(emp_no);''', env.get_db_url(env.username, env.hostname, env.password, 'employees'))

pd.crosstab(dept_and_titles_table.dept_name, dept_and_titles_table.title.count())

col_0               489903
dept_name
Customer Service     35075
Development         125586
Finance              26070
Human Resources      26618
Marketing            30138
Production          107608
Quality Management   29346
Research             31461
Sales                78001